<?php

namespace Database\Seeders;

use App\Models\Promotions;
use Illuminate\Database\Seeder;
use Illuminate\Support\Str;

class PromotionsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Promotions::insert([
            [
                'id' => 1,
                'hide' => 0,
                'name' => 'Предоставляем скидку всем нашим клиентам 1',
                'slug' => Str::slug('Предоставляем скидку всем нашим клиентам 1', '-'),
                'title' => 'xxx',
                'seo_keywords' => 'xxx',
                'seo_description' => 'xxx',
                'text' => 'Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения дальнейших направлений развития.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 2,
                'hide' => 0,
                'name' => 'Предоставляем скидку всем нашим клиентам 2',
                'slug' => Str::slug('Предоставляем скидку всем нашим клиентам 2', '-'),
                'title' => 'xxx',
                'seo_keywords' => 'xxx',
                'seo_description' => 'xxx',
                'text' => 'Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения дальнейших направлений развития.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 3,
                'hide' => 0,
                'name' => 'Предоставляем скидку всем нашим клиентам 3',
                'slug' => Str::slug('Предоставляем скидку всем нашим клиентам 3', '-'),
                'title' => 'xxx',
                'seo_keywords' => 'xxx',
                'seo_description' => 'xxx',
                'text' => 'Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения дальнейших направлений развития.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 4,
                'hide' => 0,
                'name' => 'Предоставляем скидку всем нашим клиентам 4',
                'slug' => Str::slug('Предоставляем скидку всем нашим клиентам 4', '-'),
                'title' => 'xxx',
                'seo_keywords' => 'xxx',
                'seo_description' => 'xxx',
                'text' => 'Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения дальнейших направлений развития.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 5,
                'hide' => 0,
                'name' => 'Предоставляем скидку всем нашим клиентам 5',
                'slug' => Str::slug('Предоставляем скидку всем нашим клиентам 5', '-'),
                'title' => 'xxx',
                'seo_keywords' => 'xxx',
                'seo_description' => 'xxx',
                'text' => 'Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения дальнейших направлений развития.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 6,
                'hide' => 0,
                'name' => 'Предоставляем скидку всем нашим клиентам 6',
                'slug' => Str::slug('Предоставляем скидку всем нашим клиентам 6', '-'),
                'title' => 'xxx',
                'seo_keywords' => 'xxx',
                'seo_description' => 'xxx',
                'text' => 'Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения дальнейших направлений развития.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 7,
                'hide' => 0,
                'name' => 'Предоставляем скидку всем нашим клиентам 7',
                'slug' => Str::slug('Предоставляем скидку всем нашим клиентам 7', '-'),
                'title' => 'xxx',
                'seo_keywords' => 'xxx',
                'seo_description' => 'xxx',
                'text' => 'Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения дальнейших направлений развития.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 8,
                'hide' => 0,
                'name' => 'Предоставляем скидку всем нашим клиентам 8',
                'slug' => Str::slug('Предоставляем скидку всем нашим клиентам 8', '-'),
                'title' => 'xxx',
                'seo_keywords' => 'xxx',
                'seo_description' => 'xxx',
                'text' => 'Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения дальнейших направлений развития.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 9,
                'hide' => 0,
                'name' => 'Предоставляем скидку всем нашим клиентам 9',
                'slug' => Str::slug('Предоставляем скидку всем нашим клиентам 9', '-'),
                'title' => 'xxx',
                'seo_keywords' => 'xxx',
                'seo_description' => 'xxx',
                'text' => 'Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения дальнейших направлений развития.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 10,
                'hide' => 0,
                'name' => 'Предоставляем скидку всем нашим клиентам 10',
                'slug' => Str::slug('Предоставляем скидку всем нашим клиентам 10', '-'),
                'title' => 'xxx',
                'seo_keywords' => 'xxx',
                'seo_description' => 'xxx',
                'text' => 'Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения дальнейших направлений развития.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
        ]);
    }
}
