<?php

namespace Database\Seeders;

use App\Models\Reviews;
use Illuminate\Database\Seeder;

class ReviewsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Reviews::insert([
            [
                'id' => 1,
                'hide' => 0,
                'author' => 'ТОО “IMarketing”',
                'quote' => 'Хочу поблагодарить проект-менеджера Шевченко Дарью, за отличную работу и индивидуальный подход к каждому запросу. Мы давно работаем с компанией "AVG". Качество сервиса на высшем уровне! Всегда на связи. Все наши пожелания учитываются и всегда идут на встречу.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 2,
                'hide' => 0,
                'author' => 'ТОО “IMarketing”',
                'quote' => 'Хочу поблагодарить проект-менеджера Шевченко Дарью, за отличную работу и индивидуальный подход к каждому запросу. Мы давно работаем с компанией "AVG". Качество сервиса на высшем уровне! Всегда на связи. Все наши пожелания учитываются и всегда идут на встречу.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 3,
                'hide' => 0,
                'author' => 'ТОО “IMarketing”',
                'quote' => 'Хочу поблагодарить проект-менеджера Шевченко Дарью, за отличную работу и индивидуальный подход к каждому запросу. Мы давно работаем с компанией "AVG". Качество сервиса на высшем уровне! Всегда на связи. Все наши пожелания учитываются и всегда идут на встречу.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 4,
                'hide' => 0,
                'author' => 'ТОО “IMarketing”',
                'quote' => 'Хочу поблагодарить проект-менеджера Шевченко Дарью, за отличную работу и индивидуальный подход к каждому запросу. Мы давно работаем с компанией "AVG". Качество сервиса на высшем уровне! Всегда на связи. Все наши пожелания учитываются и всегда идут на встречу.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 5,
                'hide' => 0,
                'author' => 'ТОО “IMarketing”',
                'quote' => 'Хочу поблагодарить проект-менеджера Шевченко Дарью, за отличную работу и индивидуальный подход к каждому запросу. Мы давно работаем с компанией "AVG". Качество сервиса на высшем уровне! Всегда на связи. Все наши пожелания учитываются и всегда идут на встречу.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 6,
                'hide' => 0,
                'author' => 'ТОО “IMarketing”',
                'quote' => 'Хочу поблагодарить проект-менеджера Шевченко Дарью, за отличную работу и индивидуальный подход к каждому запросу. Мы давно работаем с компанией "AVG". Качество сервиса на высшем уровне! Всегда на связи. Все наши пожелания учитываются и всегда идут на встречу.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 7,
                'hide' => 0,
                'author' => 'ТОО “IMarketing”',
                'quote' => 'Хочу поблагодарить проект-менеджера Шевченко Дарью, за отличную работу и индивидуальный подход к каждому запросу. Мы давно работаем с компанией "AVG". Качество сервиса на высшем уровне! Всегда на связи. Все наши пожелания учитываются и всегда идут на встречу.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 8,
                'hide' => 0,
                'author' => 'ТОО “IMarketing”',
                'quote' => 'Хочу поблагодарить проект-менеджера Шевченко Дарью, за отличную работу и индивидуальный подход к каждому запросу. Мы давно работаем с компанией "AVG". Качество сервиса на высшем уровне! Всегда на связи. Все наши пожелания учитываются и всегда идут на встречу.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 9,
                'hide' => 0,
                'author' => 'ТОО “IMarketing”',
                'quote' => 'Хочу поблагодарить проект-менеджера Шевченко Дарью, за отличную работу и индивидуальный подход к каждому запросу. Мы давно работаем с компанией "AVG". Качество сервиса на высшем уровне! Всегда на связи. Все наши пожелания учитываются и всегда идут на встречу.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
            [
                'id' => 10,
                'hide' => 0,
                'author' => 'ТОО “IMarketing”',
                'quote' => 'Хочу поблагодарить проект-менеджера Шевченко Дарью, за отличную работу и индивидуальный подход к каждому запросу. Мы давно работаем с компанией "AVG". Качество сервиса на высшем уровне! Всегда на связи. Все наши пожелания учитываются и всегда идут на встречу.',
                'image' => 1,
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ],
        ]);
    }
}
