<?php

return [
    'id' => 'ID',
    'hide' => 'Скрыть',
    'hide_header' => 'Скрыть данную запись?',
    'hide_description' => 'Данная запись не будет отображаться',
    'created_at' => 'Создано',
    'updated_at' => 'Обновлено',

    'name' => 'Наименование',
    'description' => 'Описание',

    'create' => 'Создать',
    'save' => 'Сохранить',
    'action' => 'Действие',
    'edit' => 'Редактировать',
    'delete' => 'Удалить',
    'delete_confirm' => 'Как только учетная запись будет удалена, все ее ресурсы и данные будут удалены безвозвратно. Перед удалением вашей учетной записи, пожалуйста, загрузите любые данные или информацию, которые вы хотите сохранить.',

    'success_updated' => 'Данные обновлены',
    'success_deleted' => 'Успешно удалено',
    'not_selected' => 'Не выбраны элементы',
    'success_mass_deleted' => 'Выбранные элементы успешно удалены',

    'category' => 'Категории',
    'subcategory' => 'Субкатегории',
    'products' => 'Товары',
    'products_edit' => 'Редактировать товар',
    'products_create' => 'Создать товар',
    'applications' => 'Список заявок',
    'reviews' => 'Отзывы',
    'news' => 'Новости',
    'promotions' => 'Акции',
    'certificates' => 'Сертификаты',
    'contacts' => 'Контакты',
    'contacts_phone' => 'Номер телефона',
    'contacts_email' => 'Почта',
    'contacts_address' => 'Адрес',
    'seo' => 'SEO',
    'header' => 'Верхний колонтитул',
    'footer' => 'Нижний колонтитул',
    'social_networks' => 'Социальные сети',

    'author' => 'Автор',
    'quote' => 'Цитата',
    'link' => 'Ссылка',

    'text' => 'Текст',
    'city' => 'Город',
    'value' => 'Значение',
    'image' => 'Изображение',

    'slug' => 'Семантический URL',
    'title' => 'Заголовок страницы',
    'seo_keywords' => 'SEO ключевые слова',
    'seo_description' => 'SEO описание',

    'company' => 'Компания',
    'phone' => 'Телефон',
    'email' => 'Почта',
    'page' => 'Страница',

    'popular' => 'Популярные',
    'popular_header' => 'Скрыть данную запись?',
    'popular_description' => 'Данная запись не будет отображаться',
];
